{
  "architectures": ["MellumForCausalLM"],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "dtype": "bfloat16",
  "eos_token_id": 0,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2304,
  "initializer_range": 0.02,
  "intermediate_size": 7168,
  "layer_types": [
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention",
    "sliding_attention",
    "sliding_attention",
    "sliding_attention",
    "full_attention"
  ],
  "mlp_layer_types": [
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse"
  ],
  "max_position_embeddings": 131072,
  "max_window_layers": 0,
  "model_type": "mellum",
  "moe_intermediate_size": 896,
  "norm_topk_prob": true,
  "num_attention_heads": 32,
  "num_experts": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "output_router_logits": false,
  "rms_norm_eps": 1e-6,
  "rope_parameters": {
    "full_attention": {
      "rope_type": "yarn",
      "rope_theta": 500000.0,
      "factor": 16.0,
      "original_max_position_embeddings": 8192,
      "beta_fast": 32.0,
      "beta_slow": 1.0,
      "attention_factor": 1.2772588722239782
    },
    "sliding_attention": {
      "rope_type": "default",
      "rope_theta": 500000.0
    }
  },
  "router_aux_loss_coef": 0.001,
  "sliding_window": 1024,
  "tie_word_embeddings": false,
  "transformers_version": "5.8.1",
  "use_cache": true,
  "vocab_size": 98304
}
