{
  "additional_special_tokens": [
    "<assistant>",
    "</assistant>",
    "<commit_before>",
    "<commit_after>",
    "<commit_msg>",
    "<empty_output>",
    "<filename>",
    "<fim_prefix>",
    "<fim_middle>",
    "<fim_suffix>",
    "<fim_pad>",
    "<gh_stars>",
    "<issue_start>",
    "<issue_comment>",
    "<issue_closed>",
    "<jupyter_text>",
    "<jupyter_code>",
    "<jupyter_start>",
    "<jupyter_output>",
    "<reponame>",
    "<system>",
    "</system>",
    "<user>",
    "</user>",
    "<|im_start|>",
    "<|im_end|>",
    "<|extra_token_7|>",
    "<|extra_token_8|>"
  ],
  "bos_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "unk_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
